In [1]:
import pandas as pd

In [8]:
csv = pd.read_table("ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt", delim_whitespace=True, comment='#', header=None)

/Users/lhinkesjones/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [47]:
df = csv.copy()

In [22]:
df.iloc[0,:]

0    1958.000
1       3.000
2    1958.208
3     315.710
4     315.710
5     314.620
6      -1.000
Name: 0, dtype: float64

In [49]:
import numpy as np
for i,row in df.iterrows():
    if row[3] == -99.99: df.iloc[i,3] = np.nan

In [52]:
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458     NaN  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

In [55]:
index = ["year", "month", "CO2", "average", "interpolated","trend", "#days"]
df.columns = index

In [56]:
df.head()

   year  month       CO2  average  interpolated   trend  #days
0  1958      3  1958.208   315.71        315.71  314.62     -1
1  1958      4  1958.292   317.45        317.45  315.29     -1
2  1958      5  1958.375   317.50        317.50  314.71     -1
3  1958      6  1958.458      NaN        317.10  314.85     -1
4  1958      7  1958.542   315.86        315.86  314.98     -1